In [2]:
import pandas as pd

## 1. Big Countries

In [26]:
data = {
    'name': ['Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola'],
    'continent': ['Asia', 'Europe', 'Africa', 'Europe', 'Africa'],
    'area': [652230, 28748, 2381741, 468, 1246700],
    'population': [25500100, 2831741, 37100000, 78115, 20609294],
    'gdp': [20343000000, 12960000000, 188681000000, 3712000000, 100990000000]
}
world = pd.DataFrame(data)
world

          name continent     area  population           gdp
0  Afghanistan      Asia   652230    25500100   20343000000
1      Albania    Europe    28748     2831741   12960000000
2      Algeria    Africa  2381741    37100000  188681000000
3      Andorra    Europe      468       78115    3712000000
4       Angola    Africa  1246700    20609294  100990000000

In [50]:
world[(world['area']>=300) | (world['population']>=2500000)][['name','population','area']]

          name  population     area
0  Afghanistan    25500100   652230
1      Albania     2831741    28748
2      Algeria    37100000  2381741
3      Andorra       78115      468
4       Angola    20609294  1246700

In [52]:
world.loc[(world['area']>=300) | (world['population']>=2500000),['name','population','area']]

          name  population     area
0  Afghanistan    25500100   652230
1      Albania     2831741    28748
2      Algeria    37100000  2381741
3      Andorra       78115      468
4       Angola    20609294  1246700

## 2. Recyclable and Low Fat Products

In [58]:
data = {
    'product_id': [0, 1, 2, 3, 4],
    'low_fats': ['Y', 'Y', 'N', 'Y', 'N'],
    'recyclable': ['N', 'Y', 'Y', 'Y', 'N']
}
df = pd.DataFrame(data)
df

   product_id low_fats recyclable
0           0        Y          N
1           1        Y          Y
2           2        N          Y
3           3        Y          Y
4           4        N          N

In [60]:
df.loc[(df['low_fats']=='Y') & (df['recyclable']=='Y'),['product_id']]

   product_id
1           1
3           3

## 3. Customers Who Never Order

In [63]:
customers_data = {
    'id': [1, 2, 3, 4],
    'name': ['Joe', 'Henry', 'Sam', 'Max']
}

# Data for Orders table
orders_data = {
    'id': [1, 2],
    'customerId': [3, 1]
}

# Create DataFrames
customers_df = pd.DataFrame(customers_data)
orders_df = pd.DataFrame(orders_data)

In [69]:
orders=list(orders_df.customerId)

In [79]:
customers_df[~customers_df['id'].isin(orders)][['name']]

    name
1  Henry
3    Max